{
    "issues": {
        "deprecated_yaml": {
            "title": "La configuración Meteo Swiss mediante YAML configuration está obsoleta",
            "description": "Configurar Meteo Swiss mediante YAML será removida a futuro.\n\nSu configuración existente ha sido importada automáticamente a su interfaz de usuario.\n\nRemueva la sección de configuración de Swiss Meteo configuration de su archivo configuration.yaml file y reinicie Home Assistant para solucionar esta advertencia."
        },
        "station_no_data": {
            "title": "Una estación meteorológica de tiempo real parece estar ausente",
            "description": "La estación de tiempo real que se usa en Meteo Swiss ({station}) parece ya no ofrecer datos.\n\nDe momento, la única reparación posible es remover esta integración y volver a agregarla, seleccionande una nueva estación meteorológica.\n\nHasta que esta reparación sea efectuada, sus sensores y el estado del tiempo actual aparecerán como no disponibles."
        }
    },
    "config": {
        "abort": {
            "already_configured": "Ya ha sido configurada",
            "unknown": "Error desconocido; por favor intente más tarde"
        },
        "error": {
            "lat": "La latitud especificada no está entre -90 y 90 grados",
            "lon": "La longitud especificada no está entre -180 y 180 grados",
            "invalid_station_name": "Estación inválida (deben ser 3 caracteres).  Verifique las estaciones aquí: https://rudd-o.com/meteostations",
            "invalid_postcode": "Código postal incorrecto.  Esta integración sólo funciona con códigos postales suizos.",
            "invalid_station_id": "Identificador de estación inválido.  Verifique las estaciones aquí: https://rudd-o.com/meteostations",
            "empty_name": "El nombre para mostrar es inválido",
            "update_interval_too_low": "La frecuencia de actualización es muy baja.  Debe ser mínimo un minuto."
        },
        "step": {
            "user": {
                "data": {
                    "latitude": "Latitud",
                    "longitude": "Longitud"
                },
                "description": "Confirme su ubicación geográfica.  Esta información será usada para sugerir un código postal y una estación meteorológica adecuadas.",
                "title": "Ubicación"
            },
            "user_two": {
                "data": {
                    "postcode": "Código postal"
                },
                "description": "El código postal se usa para obtener el pronóstico de los siguientos 5 días.",
                "title": "Código postal"
            },
            "user_three": {
                "data": {
                    "station": "Estación meteorológica en tiempo real",
                    "name": "Nombre a mostrar",
                    "update_interval": "Frecuencia de actualización en minutos"
                },
                "description": "La estación en tiempo real que se usará para obtener el clima actual.  https://rudd-o.com/meteostations lista las estaciones.",
                "title": "Estación meteorológica"
            }
        }
    }
}