{
    "issues": {
        "deprecated_yaml": {
            "title": "The Meteo Swiss YAML configuration is being removed",
            "description": "Configuring Meteo Swiss using YAML is being removed.\n\nYour existing YAML configuration has been imported into the UI automatically.\n\nRemove the Swiss Meteo configuration from your configuration.yaml file and restart Home Assistant to fix this issue."
        },
        "station_no_data": {
            "title": "Meteo Swiss weather station appears to be gone",
            "description": "The real-time weather station Meteo Swiss is using ({station}) is no longer offering data.\n\nCurrently, the only repair possible involves removing and re-adding the Meteo Swiss integration, selecting a new real-time weather station.\n\nUntil this repair is made, all real-time weather sensors and reports coming from this station will show as unavailable."
        },
        "improperly_configured": {
            "title": "Meteo Swiss integration improperly configured",
            "description": "The Meteo Swiss integration with entry ID {entry_id} is improperly configured.\n\nPlease remove your configuration entry and recreate it."
        }
    },
    "config": {
        "abort": {
            "already_configured": "Byen er allerede konfigurert",
            "unknown": "Ukjent feil: prøv på nytt senere"
        },
        "error": {
            "lat": "The supplied latitude does not fall between -90 y 90 degrees",
            "lon": "The supplied latitude does not fall between -180 y 180 degrees",
            "invalid_station_name": "Stasjonsnavnet er ugyldig; vennligst sjekk https://rudd-o.com/meteostations for stasjonsliste",
            "invalid_postcode": "Postnummer er ugyldig. Denne integrasjonen fungerer bare med Sveits postnummer",
            "forecast_name_empty": "Forecast name cannot be empty",
            "empty_name": "The display name is empty",
            "update_interval_too_low": "The update interval is too low.  Must be minimum 1 minute."
        },
        "step": {
            "user": {
                "data": {
                    "latitude": "Latitude",
                    "longitude": "Longitude"
                },
                "description": "Confirm your geographical position.  This will be used to guess the closest real-time weather station and approximate your postal code for forecasts.",
                "title": "Location"
            },
            "user_two": {
                "data": {
                    "postcode": "Postnummer",
                    "forecast_name": "Forecast (weather) entity name",
                    "update_interval": "Oppdateringsintervall i minutter"
                },
                "description": "The postal code is used to look up the 5-day forecast.  The name you enter here will be used for the forecast (weather) entity.",
                "title": "Forecast"
            },
            "user_three": {
                "data": {
                    "station": "Sanntids værstasjon",
                    "real_time_name": "Real-time entity names"
                },
                "description": "The real-time weather station is used to look up the current weather at the station and provide them as sensors.  Selecting the first option of the list disables real-time weather sensors.\n\nIf a weather station is selected, the real-time entity names field is used to name the real-time (sensor) entities.  If no station is chosen, the real-time entity names field is ignored.\n\nhttps://rudd-o.com/meteostations lists the available real-time weather stations.",
                "title": "Real-time weather"
            }
        }
    }
}